ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C2000/f28p551x_dcsm_z1_regs.xml
<module id="DCSM_Z1_REGS" HW_revision="" description="DCSM Z1 Registers">
	<register id="Z1_LINKPOINTER" width="32" page="1" offset="0x0" internal="0" description="Zone 1 Link Pointer">
		<bitfield id="LINKPOINTER" description="Zone1 LINK Pointer" begin="13" end="0" width="14" rwaccess="R"/>
	</register>
	<register id="Z1_OTPSECLOCK" width="32" page="1" offset="0x2" internal="0" description="Zone 1 OTP Secure Lock">
		<bitfield id="JTAGLOCK" description="JTAG Lock Status" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="PSWDLOCK" description="Zone1 Password Lock." begin="7" end="4" width="4" rwaccess="R"/>
		<bitfield id="CRCLOCK" description="Zone1 CRC Lock." begin="11" end="8" width="4" rwaccess="R"/>
	</register>
	<register id="Z1_JLM_ENABLE" width="32" page="1" offset="0x4" internal="0" description="Zone 1 JTAGLOCK Enable Register">
		<bitfield id="Z1_JLM_ENABLE" description="Zone1 JLM_ENABLE register." begin="3" end="0" width="4" rwaccess="R"/>
	</register>
	<register id="Z1_LINKPOINTERERR" width="32" page="1" offset="0x6" internal="0" description="Link Pointer Error">
		<bitfield id="Z1_LINKPOINTERERR" description="Error to Resolve Z1 Link pointer from OTP loaded values" begin="13" end="0" width="14" rwaccess="R"/>
	</register>
	<register id="Z1_GPREG1" width="32" page="1" offset="0x8" internal="0" description="Zone 1 General Purpose Register-1">
		<bitfield id="GPREG1" description="General Purpose Register-1" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1_GPREG2" width="32" page="1" offset="0xa" internal="0" description="Zone 1 General Purpose Register-2">
		<bitfield id="GPREG2" description="General Purpose Register-2" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1_GPREG3" width="32" page="1" offset="0xc" internal="0" description="Zone 1 General Purpose Register-3">
		<bitfield id="GPREG3" description="General Purpose Register-3" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1_GPREG4" width="32" page="1" offset="0xe" internal="0" description="Zone 1 General Purpose Register-4">
		<bitfield id="GPREG4" description="General Purpose Register-4" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1_CSMKEY0" width="32" page="1" offset="0x10" internal="0" description="Zone 1 CSM Key 0">
		<bitfield id="Z1_CSMKEY0" description="Word0 to unlock Zone1, should match  Z1_CSMPSWD0." begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="Z1_CSMKEY1" width="32" page="1" offset="0x12" internal="0" description="Zone 1 CSM Key 1">
		<bitfield id="Z1_CSMKEY1" description="Word1 to unlock Zone1, should match Z1_CSMPSWD1" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="Z1_CSMKEY2" width="32" page="1" offset="0x14" internal="0" description="Zone 1 CSM Key 2">
		<bitfield id="Z1_CSMKEY2" description="Word2 to unlock Zone1, should match Z1_CSMPSWD2" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="Z1_CSMKEY3" width="32" page="1" offset="0x16" internal="0" description="Zone 1 CSM Key 3">
		<bitfield id="Z1_CSMKEY3" description="Word3 to unlock Zone1, should match Z1_CSMPSWD3" begin="31" end="0" width="32" rwaccess="RW"/>
	</register>
	<register id="Z1_CR" width="32" page="1" offset="0x18" internal="0" description="Zone 1 CSM Control Register">
		<bitfield id="ALLZERO" description="CSMPSWD All Zeros" begin="19" end="19" width="1" rwaccess="R"/>
		<bitfield id="ALLONE" description="CSMPSWD All Ones" begin="20" end="20" width="1" rwaccess="R"/>
		<bitfield id="UNSECURE" description="CSMPSWD Match CSMKEY" begin="21" end="21" width="1" rwaccess="R"/>
		<bitfield id="ARMED" description="CSM Passwords Read Status" begin="22" end="22" width="1" rwaccess="R"/>
		<bitfield id="FORCESEC" description="Force Secure" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="Z1_GRABSECT1R" width="32" page="1" offset="0x1a" internal="0" description="Zone 1 Grab Flash Status Register 1">
		<bitfield id="GRAB_B0_SECT0" description="Grab Flash Bank0 Sector 0" begin="1" end="0" width="2" rwaccess="R"/>
		<bitfield id="GRAB_B0_SECT1" description="Grab Flash Bank0 Sector 1" begin="3" end="2" width="2" rwaccess="R"/>
		<bitfield id="GRAB_B0_SECT2" description="Grab Flash Bank0 Sector 2" begin="5" end="4" width="2" rwaccess="R"/>
		<bitfield id="GRAB_B0_SECT3" description="Grab Flash Bank0 Sector 3" begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="GRAB_B0_SECT31_4" description="Grab Flash Bank0 Sector 31-4" begin="9" end="8" width="2" rwaccess="R"/>
		<bitfield id="GRAB_B0_SECT63_32" description="Grab Flash Bank0 Sector 63-32" begin="11" end="10" width="2" rwaccess="R"/>
		<bitfield id="GRAB_B0_SECT95_64" description="Grab Flash Bank0 Sector 95-64" begin="13" end="12" width="2" rwaccess="R"/>
		<bitfield id="GRAB_B0_SECT127_96" description="Grab Flash Bank0 Sector 127-96" begin="15" end="14" width="2" rwaccess="R"/>
	</register>
	<register id="Z1_GRABSECT2R" width="32" page="1" offset="0x1c" internal="0" description="Zone 1 Grab Flash Status Register 2">
		<bitfield id="GRAB_B2_SECT0" description="Grab Flash Bank2 Sector 0" begin="1" end="0" width="2" rwaccess="R"/>
		<bitfield id="GRAB_B2_SECT1" description="Grab Flash Bank2 Sector 1" begin="3" end="2" width="2" rwaccess="R"/>
		<bitfield id="GRAB_B2_SECT2" description="Grab Flash Bank2 Sector 2" begin="5" end="4" width="2" rwaccess="R"/>
		<bitfield id="GRAB_B2_SECT3" description="Grab Flash Bank2 Sector 3" begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="GRAB_B2_SECT31_4" description="Grab Flash Bank2 Sector 31-4" begin="9" end="8" width="2" rwaccess="R"/>
		<bitfield id="GRAB_B2_SECT63_32" description="Grab Flash Bank2 Sector 63-32" begin="11" end="10" width="2" rwaccess="R"/>
		<bitfield id="GRAB_B2_SECT95_64" description="Grab Flash Bank2 Sector 95-64" begin="13" end="12" width="2" rwaccess="R"/>
		<bitfield id="GRAB_B2_SECT127_96" description="Grab Flash Bank2 Sector 127-96" begin="15" end="14" width="2" rwaccess="R"/>
	</register>
	<register id="Z1_GRABSECT3R" width="32" page="1" offset="0x1e" internal="0" description="Zone 1 Grab Flash Status Register 3">
		<bitfield id="GRAB_B4_SECT0" description="Grab Flash Bank4 Sector 0" begin="1" end="0" width="2" rwaccess="R"/>
		<bitfield id="GRAB_B4_SECT1" description="Grab Flash Bank4 Sector 1" begin="3" end="2" width="2" rwaccess="R"/>
		<bitfield id="GRAB_B4_SECT2" description="Grab Flash Bank4 Sector 2" begin="5" end="4" width="2" rwaccess="R"/>
		<bitfield id="GRAB_B4_SECT3" description="Grab Flash Bank4 Sector 3" begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="GRAB_B4_SECT31_4" description="Grab Flash Bank4 Sector 31-4" begin="9" end="8" width="2" rwaccess="R"/>
	</register>
	<register id="Z1_GRABRAM1R" width="32" page="1" offset="0x20" internal="0" description="Zone 1 Grab RAM Status Register 1">
		<bitfield id="GRAB_RAM0" description="Grab RAM LS0" begin="1" end="0" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM1" description="Grab RAM LS1" begin="3" end="2" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM2" description="Grab RAM LS2" begin="5" end="4" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM3" description="Grab RAM LS3" begin="7" end="6" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM4" description="Grab RAM LS4" begin="9" end="8" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM5" description="Grab RAM LS5" begin="11" end="10" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM6" description="Grab RAM LS6" begin="13" end="12" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM7" description="Grab RAM LS7" begin="15" end="14" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM8" description="Grab RAM LS8" begin="17" end="16" width="2" rwaccess="R"/>
		<bitfield id="GRAB_RAM9" description="Grab RAM LS9" begin="19" end="18" width="2" rwaccess="R"/>
	</register>
	<register id="Z1_EXEONLYSECT1R" width="32" page="1" offset="0x26" internal="0" description="Zone 1 Execute Only Flash Status Register 1">
		<bitfield id="EXEONLY_B0_SECT0" description="Execute-Only Flash Bank0 Sector 0" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_B0_SECT1" description="Execute-Only Flash Bank0 Sector 1" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_B0_SECT2" description="Execute-Only Flash Bank0 Sector 2" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_B0_SECT3" description="Execute-Only Flash Bank0 Sector 3" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_B0_SECT31_4" description="Execute-Only Flash Bank0 Sector 31-4" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_B0_SECT63_32" description="Execute-Only Flash Bank0 Sector 63-32" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_B0_SECT95_64" description="Execute-Only Flash Bank0 Sector 95-64" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_B0_SECT127_96" description="Execute-Only Flash Bank0 Sector 127-96" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_B2_SECT0" description="Execute-Only Flash Bank2 Sector 0" begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_B2_SECT1" description="Execute-Only Flash Bank2 Sector 1" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_B2_SECT2" description="Execute-Only Flash Bank2 Sector 2" begin="18" end="18" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_B2_SECT3" description="Execute-Only Flash Bank2 Sector 3" begin="19" end="19" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_B2_SECT31_4" description="Execute-Only Flash Bank2 Sector 31-4" begin="20" end="20" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_B2_SECT63_32" description="Execute-Only Flash Bank2 Sector 63-32" begin="21" end="21" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_B2_SECT95_64" description="Execute-Only Flash Bank2 Sector 95-64" begin="22" end="22" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_B2_SECT127_96" description="Execute-Only Flash Bank2 Sector 127-96" begin="23" end="23" width="1" rwaccess="R"/>
	</register>
	<register id="Z1_EXEONLYSECT2R" width="32" page="1" offset="0x28" internal="0" description="Zone 1 Execute Only Flash Status Register 2">
		<bitfield id="EXEONLY_B4_SECT0" description="Execute-Only Flash Bank4 Sector 0" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_B4_SECT1" description="Execute-Only Flash Bank4 Sector 1" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_B4_SECT2" description="Execute-Only Flash Bank4 Sector 2" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_B4_SECT3" description="Execute-Only Flash Bank4 Sector 3" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_B4_SECT31_4" description="Execute-Only Flash Bank4 Sector 31-4" begin="4" end="4" width="1" rwaccess="R"/>
	</register>
	<register id="Z1_EXEONLYRAM1R" width="32" page="1" offset="0x2a" internal="0" description="Zone 1 Execute Only RAM Status Register 1">
		<bitfield id="EXEONLY_RAM0" description="Execute-Only RAM LS0" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM1" description="Execute-Only RAM LS1" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM2" description="Execute-Only RAM LS2" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM3" description="Execute-Only RAM LS3" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM4" description="Execute-Only RAM LS4" begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM5" description="Execute-Only RAM LS5" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM6" description="Execute-Only RAM LS6" begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM7" description="Execute-Only RAM LS7" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM8" description="Execute-Only RAM LS8" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="EXEONLY_RAM9" description="Execute-Only RAM LS9" begin="9" end="9" width="1" rwaccess="R"/>
	</register>
	<register id="Z1_JTAGKEY0" width="32" page="1" offset="0x2e" internal="0" description="JTAG Unlock Key Register 0">
		<bitfield id="KEY0" description="JTAGKEY Bits 31:0" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1_JTAGKEY1" width="32" page="1" offset="0x30" internal="0" description="JTAG Unlock Key Register 1">
		<bitfield id="KEY1" description="JTAGKEY Bits 63:32" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1_JTAGKEY2" width="32" page="1" offset="0x32" internal="0" description="JTAG Unlock Key Register 2">
		<bitfield id="KEY2" description="JTAGKEY Bits 95:64" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1_JTAGKEY3" width="32" page="1" offset="0x34" internal="0" description="JTAG Unlock Key Register 3">
		<bitfield id="KEY3" description="JTAGKEY Bits 127:96" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1_CMACKEY0" width="32" page="1" offset="0x36" internal="0" description="Secure Boot CMAC Key Status Register 0">
		<bitfield id="KEY0" description="CMACKEY Bits 31:0" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1_CMACKEY1" width="32" page="1" offset="0x38" internal="0" description="Secure Boot CMAC Key Status Register 1">
		<bitfield id="KEY1" description="CMACKEY Bits 63:32" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1_CMACKEY2" width="32" page="1" offset="0x3a" internal="0" description="Secure Boot CMAC Key Status Register 2">
		<bitfield id="KEY2" description="CMACKEY Bits 95:64" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1_CMACKEY3" width="32" page="1" offset="0x3c" internal="0" description="Secure Boot CMAC Key Status Register 3">
		<bitfield id="KEY3" description="CMACKEY Bits 127:96" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="Z1_DIAG" width="32" page="1" offset="0x3e" internal="0" description="Diagnostics Configuration Register">
		<bitfield id="MPOST_EN" description="MPOST Enable" begin="5" end="4" width="2" rwaccess="R"/>
	</register>
</module>
